## Pandas Concatenate Tutorial

### Basic Concatenation

In [1]:
import pandas as pd

italy_weather = pd.DataFrame({
    "city": ["Rome","Napoli","Milan"],
    "temperature": [32,45,30],
    "humidity": [80, 60, 78]
})
italy_weather

     city  temperature  humidity
0    Rome           32        80
1  Napoli           45        60
2   Milan           30        78

In [2]:
us_weather = pd.DataFrame({
    "city": ["new york","chicago","orlando"],
    "temperature": [21,14,35],
    "humidity": [68, 65, 75]
})
us_weather

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [3]:
df = pd.concat([italy_weather, us_weather])
df

       city  temperature  humidity
0      Rome           32        80
1    Napoli           45        60
2     Milan           30        78
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

### Ignore Index

In [4]:
df = pd.concat([italy_weather, us_weather], ignore_index=True)
df

       city  temperature  humidity
0      Rome           32        80
1    Napoli           45        60
2     Milan           30        78
3  new york           21        68
4   chicago           14        65
5   orlando           35        75

In [5]:
df.to_csv("concatinatedDFs.csv" , index=False)

### Concatenation And Keys

In [6]:
df = pd.concat([italy_weather, us_weather], keys=["italy", "us"])
df

             city  temperature  humidity
italy 0      Rome           32        80
      1    Napoli           45        60
      2     Milan           30        78
us    0  new york           21        68
      1   chicago           14        65
      2   orlando           35        75

In [7]:
df.loc["us"] #location

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [8]:
df.loc["italy"]

     city  temperature  humidity
0    Rome           32        80
1  Napoli           45        60
2   Milan           30        78

In [9]:
df.to_csv("newdf.csv" , index_label=True)

### Concatenation Using Index

In [10]:
temperature_df = pd.DataFrame({
    "city": ["mumbai","delhi","banglore"],
    "temperature": [32,45,30],
}, index=[4,5,2])
temperature_df

       city  temperature
4    mumbai           32
5     delhi           45
2  banglore           30

In [11]:
windspeed_df = pd.DataFrame({
    "city": ["delhi","mumbai"],
    "windspeed": [7,12],
}, index=[1,0])
windspeed_df

     city  windspeed
1   delhi          7
0  mumbai         12

In [12]:
df = pd.concat([temperature_df,windspeed_df])
df

       city  temperature  windspeed
4    mumbai         32.0        NaN
5     delhi         45.0        NaN
2  banglore         30.0        NaN
1     delhi          NaN        7.0
0    mumbai          NaN       12.0

### Concatenate dataframe with series

In [13]:
s = pd.Series(["Humid","Dry","Rain"], name="event")

In [14]:
df = pd.concat([df,s],axis=1)
df

       city  temperature  windspeed  event
4    mumbai         32.0        NaN    NaN
5     delhi         45.0        NaN    NaN
2  banglore         30.0        NaN   Rain
1     delhi          NaN        7.0    Dry
0    mumbai          NaN       12.0  Humid

## Task : How to sort dataframe by index, how to sort dataframe by specific column

In [17]:
Data=pd.DataFrame({
    "A":[1,2,3],
    "B":[4,5,6]
},index=[3,2,1])

sort_index=Data.sort_index()
print(sort_index)

   A  B
1  3  6
2  2  5
3  1  4

In [19]:
data=pd.DataFrame({
    "A":[1,2,3],
    "B":[4,5,6]
})
sort_column=data.sort_values(by='A')        #Sort in ascending order (default)
print(sort_column)

   A  B
0  1  4
1  2  5
2  3  6

In [20]:
data=pd.DataFrame({
    "A":[1,2,3],
    "B":[4,5,6]
})
sort_column=data.sort_values(by='B')        #Sort in ascending order (default)
print(sort_column)

   A  B
0  1  4
1  2  5
2  3  6